In [1]:
import pandas as pd
import numpy as np
import configparser

In [2]:
config= configparser.ConfigParser()
config.read('config.cfg')

['config.cfg']

In [3]:
config.get('RDS', 'DB_HOST')

'database-proyectofinal.cz20sgeuegi2.us-east-2.rds.amazonaws.com'

In [4]:
mysql_driver = f"""mysql+pymysql://{config.get('RDS', 'DB_USERNAME')}:{config.get('RDS', 'DB_PASSWORD')}@{config.get('RDS', 'DB_HOST')}:{config.get('RDS','DB_PORT')}/{config.get('RDS', 'DB_NAME')}"""

In [5]:
mysql_driver

'mysql+pymysql://admin_mysql:Bl6$stispufrlko&aKus@database-proyectofinal.cz20sgeuegi2.us-east-2.rds.amazonaws.com:3306/proyectofinal'

### Cargamos el archivo flights.csv

In [6]:
flights_data = pd.read_csv('./data/flights.csv')
flights_data.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00

In [7]:
flights_data.to_sql('flights', mysql_driver, index=False, if_exists='append')

336776

## Cargamos el archivo airlines.csv

In [17]:
airlines_data = pd.read_csv('./data/airlines.csv')
airlines_data.head()

  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.
3      B6         JetBlue Airways
4      DL    Delta Air Lines Inc.

In [18]:
airlines_data.to_sql('airlines', mysql_driver, index=False, if_exists='append')

16

## Cargamos el archivo airports.csv

In [19]:
airports_data = pd.read_csv('./data/airports.csv')
airports_data.head()

,faa,name,lat,lon,alt,tz,dst,tzone
0,04G,Lansdowne Airport,41.130472,-80.619583,1044,-5,A,America/New_York
1,06A,Moton Field Municipal Airport,32.460572,-85.680028,264,-6,A,America/Chicago
2,06C,Schaumburg Regional,41.989341,-88.101243,801,-6,A,America/Chicago
3,06N,Randall Airport,41.431912,-74.391561,523,-5,A,America/New_York
4,09J,Jekyll Island Airport,31.074472,-81.427778,11,-5,A,America/New_York

In [20]:
airports_data.to_sql('airports', mysql_driver, index=False, if_exists='append')

1458

## Cargamos el archivo planes.csv

In [21]:
planes_data = pd.read_csv('./data/planes.csv')
planes_data.head()

,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,N10156,2004.0,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,NaN,Turbo-fan
1,N102UW,1998.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
2,N103US,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
3,N104UW,1999.0,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,NaN,Turbo-fan
4,N10575,2002.0,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,NaN,Turbo-fan

In [22]:
planes_data.to_sql('planes', mysql_driver, index=False, if_exists='append')

3322

## Cargamos el archivo weather.csv

In [11]:
weather_data = pd.read_csv('./data/weather.csv')
weather_data.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,1,39.02,26.06,59.37,270.0,10.35702,NaN,0.0,1012.0,10.0,2013-01-01T06:00:00Z
1,EWR,2013,1,1,2,39.02,26.96,61.63,250.0,8.05546,NaN,0.0,1012.3,10.0,2013-01-01T07:00:00Z
2,EWR,2013,1,1,3,39.02,28.04,64.43,240.0,11.50780,NaN,0.0,1012.5,10.0,2013-01-01T08:00:00Z
3,EWR,2013,1,1,4,39.92,28.04,62.21,250.0,12.65858,NaN,0.0,1012.2,10.0,2013-01-01T09:00:00Z
4,EWR,2013,1,1,5,39.02,28.04,64.43,260.0,12.65858,NaN,0.0,1011.9,10.0,2013-01-01T10:00:00Z

In [12]:
weather_data.to_sql('weather', mysql_driver, index=False, if_exists='append')

26115

### Lectura de datos

In [17]:
sql_query = 'SELECT * FROM airports;'
df_airports = pd.read_sql(sql_query, mysql_driver)
df_airlines.head()

,airports_id,faa,name,lat,lon,alt,tz,dst,tzone
0,17,04G,Lansdowne Airport,41.13,-80.62,1044,-5,A,America/New_York
1,18,06A,Moton Field Municipal Airport,32.46,-85.68,264,-6,A,America/Chicago
2,19,06C,Schaumburg Regional,41.99,-88.10,801,-6,A,America/Chicago
3,20,06N,Randall Airport,41.43,-74.39,523,-5,A,America/New_York
4,21,09J,Jekyll Island Airport,31.07,-81.43,11,-5,A,America/New_York

In [18]:
sql_query = 'SELECT * FROM planes;'
df_planes = pd.read_sql(sql_query, mysql_driver)
df_planes.head()

,planes_id,tailnum,year,type,manufacturer,model,engines,seats,speed,engine
0,606,N10156,2004,Fixed wing multi engine,EMBRAER,EMB-145XR,2,55,,Turbo-fan
1,607,N102UW,1998,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,,Turbo-fan
2,608,N103US,1999,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,,Turbo-fan
3,609,N104UW,1999,Fixed wing multi engine,AIRBUS INDUSTRIE,A320-214,2,182,,Turbo-fan
4,610,N10575,2002,Fixed wing multi engine,EMBRAER,EMB-145LR,2,55,,Turbo-fan

In [20]:
sql_query = 'SELECT * FROM weather;'
df_weather = pd.read_sql(sql_query, mysql_driver)
df_weather.head()

,weather_id,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,17,EWR,2013,1,1,1,39.02,26.06,59.37,270,10.36,,0,999.99,10,2013-01-01 06:00:00
1,18,EWR,2013,1,1,2,39.02,26.96,61.63,250,8.06,,0,999.99,10,2013-01-01 07:00:00
2,19,EWR,2013,1,1,3,39.02,28.04,64.43,240,11.51,,0,999.99,10,2013-01-01 08:00:00
3,20,EWR,2013,1,1,4,39.92,28.04,62.21,250,12.66,,0,999.99,10,2013-01-01 09:00:00
4,21,EWR,2013,1,1,5,39.02,28.04,64.43,260,12.66,,0,999.99,10,2013-01-01 10:00:00

In [1]:
sql_query = 'SELECT * FROM flights;'
df_flights = pd.read_sql(sql_query, mysql_driver)
df_flights.head()

NameError: name 'pd' is not defined

### Exploracion de datos

In [7]:
# dimensiones de la tabla flights
df_flights.shape

NameError: name 'df_flights' is not defined

In [8]:
df_flights.dtypes

NameError: name 'df_flights' is not defined

In [28]:
aterrizajes total_aterrizajes = df_flights.groupby('origin')['dep_time'].sum()total_aterrizajes_sorted = total_aterrizajes.sort_values(ascending=False) 
total_aterrizajes_percentage = total_aterrizajes_sorted / total_aterrizajes_sorted.sum() 
cumulative_percentage = total_aterrizajes_percentage.cumsum() 
target_country = cumulative_percentage[(cumulative_percentage >= 0.70) & (cumulative_percentage <= 0.85)].index[0] 
aviones_por_pais = df_flights[df_flights['origin'] == target_country].groupby('Avión')['Aterrizajes'].sum() 
avion_mas_comun = aviones_por_pais.idxmax() 
print(f"El pn entre el 85% y el 70% de la cantidad de aterrizajes es: {target_country}") 
print(f"El avión más común en este país es: {avion_mas_comun}")

SyntaxError: invalid syntax (2862248690.py, line 1)

In [30]:
sql_query = 'SELECT * FROM airports;'
df_airports = pd.read_sql(sql_query, mysql_driver)
df_airports.head()

,airports_id,faa,name,lat,lon,alt,tz,dst,tzone
0,17,04G,Lansdowne Airport,41.13,-80.62,1044,-5,A,America/New_York
1,18,06A,Moton Field Municipal Airport,32.46,-85.68,264,-6,A,America/Chicago
2,19,06C,Schaumburg Regional,41.99,-88.10,801,-6,A,America/Chicago
3,20,06N,Randall Airport,41.43,-74.39,523,-5,A,America/New_York
4,21,09J,Jekyll Island Airport,31.07,-81.43,11,-5,A,America/New_York

In [34]:
# Definir la consulta SQL
sql_query = 'SELECT * FROM airports;'
ORDER BY temperature DESC
LIMIT 1;
print("El aeropuerto con la temperatura más alta registrada es:", df['airport_code'][0])

SyntaxError: invalid syntax (713206505.py, line 3)

## Indique la media, median, minimo, maximo y desviación estándar de las millas recorridas por cada avión, debe mostrar el nombre del avión y la información estadística en columnas adicionales